## One-to-One Joins

In [7]:
import pandas as pd
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue','Lisa'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR','HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})

In [8]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
4     Lisa           HR

In [9]:
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [10]:
pd.merge(df1,df2)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3     Lisa           HR       2004
4      Sue           HR       2014

In [13]:
df3 = pd.merge(df2,df1)

## Many-to-one joins

In [14]:
df3

  employee  hire_date        group
0     Lisa       2004  Engineering
1     Lisa       2004           HR
2      Bob       2008   Accounting
3     Jake       2012  Engineering
4      Sue       2014           HR

In [15]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})

In [16]:
df4

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [17]:
df3.merge(df4)

  employee  hire_date        group supervisor
0     Lisa       2004  Engineering      Guido
1     Jake       2012  Engineering      Guido
2     Lisa       2004           HR      Steve
3      Sue       2014           HR      Steve
4      Bob       2008   Accounting      Carly

### Mant to Many Joins

In [18]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                              'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux',
                               'spreadsheets', 'organization']})

In [19]:
df5

         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

In [20]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
4     Lisa           HR

In [22]:
df1.merge(df5)

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization
8     Lisa           HR  spreadsheets
9     Lisa           HR  organization

### Specification of the Merge Key

In [23]:
pd.merge(df1,df2,on='employee')

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3     Lisa           HR       2004
4      Sue           HR       2014

### left_on right_on keywords
For df having no common column name

In [24]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})

In [25]:
df3

   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [26]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
4     Lisa           HR

In [67]:
pd.merge(df1,df3,left_on="employee",right_on="name").drop('name',axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

### left_index & right_index

In [33]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
4     Lisa           HR

In [68]:
df1x = df1.set_index('employee')
df1x

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
Lisay              HR

In [69]:
df2x = df2.set_index('employee')
df2x

          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [39]:
pd.merge(df1x, df2x, left_index=True, right_index=True)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Lisa               HR       2004
Sue                HR       2014

In [40]:
df1x

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
Lisa               HR

In [41]:
df2x

          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [42]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue','Lisay'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR','HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})

In [43]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
4    Lisay           HR

In [44]:
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [45]:
pd.merge(df1,df2)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [47]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']},
                   columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])

In [48]:
df6

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

In [49]:
df7

     name drink
0    Mary  wine
1  Joseph  beer

In [51]:
pd.merge(df6,df7, how='inner')

   name   food drink
0  Mary  bread  wine

In [52]:
pd.merge(df6,df7, how='outer')

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [54]:
pd.merge(df6,df7,how='left')

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [55]:
pd.merge(df6,df7,how='right')

     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer

In [56]:
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [1, 2, 3, 4]})
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [3, 1, 4, 2]})

In [57]:
df8

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

In [58]:
df9

   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

In [71]:
pd.merge(df8,df9,on='name', suffixes=['_L','_R'])

   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [61]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data': range(6)}, columns=['key', 'data'])

In [62]:
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [65]:
df.groupby('key').count()

     data
key
A       2
B       2
C       2